[
{"recipe_name": "\n                Carrot And Lentil Purée\n            ", "description": "\n                    Introduce your infant to solids with this naturally sweet tasting carrot and lentil purée with a pleasant texture.\n                ", "ingredients": ["\n                ", "500g of carrots", "\n1 cup of lentils", "\n                ", "1 cup water", "\n                ", "Food processor/blender"], "methods": ["Trim, peel and cut carrots into 1-inch slices. ", "\n", "Rinse lentils in cold water.", "\n", "Bring a medium pot of water or broth to the boil and add carrot slices and lentils. ", "\n", "Reduce to a simmer, cover the pot and cook for 25 minutes. ", "\n", "Let it cool.", "\n", "Purée in a food processor or blender.", "\n"]},
{"recipe_name": "\n                Chicken Barley Soup\n            ", "description": "\n                    Great for the whole family to enjoy whilst increasing milk production for mom.\n                ", "ingredients": ["\n                ", "1 tbsp. olive oil", "\n1 onion (chopped)", "\n1 punnet of button mushrooms (sliced)", "\n2 carrots (peeled and diced)", "\n2 garlic cloves (minced)", "\n                ", "450 g baby potatoes (cut into small pieces)", "\n900 ml of vegetable broth", "\n1 cup water", "\n                ", "½ cup pearl barley (rinsed)", "\n2 skinless boneless chicken breasts (cut into small cubes)", "\n1 cup frozen green peas"], "methods": ["Heat a large pot over medium heat and add oil. Add onions and cook for about 3 minutes or until onions soften.", "\n", "Add mushrooms, carrots, potatoes and garlic and cook for 3 minutes until mushrooms soften.", "\n", "Add broth, water and barley and bring to the boil and then reduce heat to medium-low.", "\n", "Leave the soup to simmer with the lid on for 25 minutes.", "\n", "Add chicken and peas and cook for 10 minutes until chicken is cooked through."]},
{"recipe_name": "\n                Baby Brown Rice Cereal\n            ", "description": "\n                    Rice cereal is perfect for a baby’s first food because it is easily digestible and free of food allergies.\n                ", "ingredients": ["\n                ", "½ cup brown rice", "\n                ", "4 cups of water", "\n                ", "Food processor/blender"], "methods": ["Add the uncooked brown rice to the food processor and mill to a fine powder.  ", "\n", "Add the milled brown rice and 4 cups of water to a pot and bring to the boil. Lower the heat and cook with the lid on for 20 minutes. ", "\n", "Check consistency and add water if you want it to make it thinner.", "\n", "Once satisfied with the consistency, pour the rice cereal into storage cups to freeze or refrigerate.  ", "\n", "This cereal can be refrigerated for up to 3 days, or in the freezer for 30 days.", "\n", "To serve, heat up or thaw an entire cube of cereal."]},
{"recipe_name": "\n                Home-Made Pizza\n            ", "description": "\n                    Here’s a toddler recipe to keep little bellies full and hands busy. They can decorate these pizzas themselves and pack in four of their five-a-day.\n                ", "ingredients": ["\n                ", "150 g spelt flour", "\n350 g white flour", "\n1 ½ tsp. dried fast action yeast", "\n½ tsp. salt", "\n1 tbsp. olive oil", "\n                ", "1 can chopped tomatoes", "\n1 small garlic clove", "\npinch of dried thyme", "\n                ", "160 g grated cheddar and mozzarella cheese", "\n1 red pepper (cut into strips)", "\n1 yellow pepper (cut into strips)", "\n1 courgette (slices)", "\n1 punnet of cherry tomatoes (halved)", "\n1 handful of pitted olives", "\n1 can salt-free sweetcorn (drained)"], "methods": ["For the dough, add both flours into a large bowl, then stir in the yeast and salt.", "\n", "With your hands, make a well and pour in 400 ml warm water and the olive oil and mix with a wooden spoon until you have a soft, fairly wet dough.", "\n", "Give dough a light knead in the bowl to bring together and then turn onto a lightly floured surface. Knead for 5 minutes until dough is smooth.", "\n", "Cover with a tea towel and set aside for the dough to rise.", "\n", "For the sauce, blitz tomatoes, garlic and thyme with a little seasoning in a food processor or using hand blender.", "\n", "Preheat oven to 220 °C or 240 °C with fan.  ", "\n", "Prepare toppings so your kids can decorate their own pizzas.", "\n", "Once the dough has risen, give it a little knead in the bowl and then separate into four balls.", "\n", "Roll two balls into wide circles with a rolling pin on a floured surface. Ensure the dough is thin as it will rise in the oven. Transfer onto two floured baking sheets or pizza trays.", "\n", "Spread sauce over each base with a spoon and ensure a smooth finish.", "\n", "Scatter cheese. You are now ready to start making the faces.", "\n", "Once you are done decorating, bake in oven for 10 – 15 mins until crisp. Swop the pizzas to a lower shelf halfway through to avoid burning the toppings.", "\n", "Repeat for the second two pizzas or freeze the balls of dough in two separate freezer bags. You can also freeze any remaining sauce in a sealed container.", "\n"]},
{"recipe_name": "\n                Peanut Butter Bites\n            ", "description": "\n                    Oats are high in iron and help promote milk supply. This makes them essential for expectant mothers. \n                ", "ingredients": ["\n                ", "1 cup rolled oats", "\n¼ cup ground flaxseed", "\n¼ cup sliced almonds (chopped)", "\n2 tbsp. of chia seeds", "\nA pinch of cinnamon", "\n                ", "A pinch of salt", "\n¼ cup + 2 tbsp. creamy peanut butter", "\n¼ cup + 1 tbsp. honey", "\n¼ tsp. vanilla extract", "\n                ", "2 tbsp. chocolate chips", "\n¼ cup ground peanuts/ground almonds to roll the balls in."], "methods": ["Combine oats, almonds, flaxseed, chia seeds, salt and cinnamon in a large bowl and stir.", "\n", "Melt peanut butter, allow it to cool slightly and then stir in honey and vanilla extract until combined.", "\n", "When the peanut butter has cooled, pour over the oat mixture and mix well with a spoon.", "\n", "Once mixture is sticking together, fold in chocolate chips.", "\n", "Roll mixture into golf ball-sized (or smaller) balls, and then roll in ground peanuts or ground almonds.", "\n", "Can be eaten at room temperature but best once refrigerated.", "\n"]},
{"recipe_name": "\n                Chicken Burger and Wedges\n            ", "description": "\n                    Tuck into a mouth-watering grilled chicken burger while you watch the game, complete with smoky BBQ sauce, pineapple slices & sweet potato wedges. This meal is not only delicious, it’s a nutritious fast food too.\n                ", "ingredients": ["\n                ", "6 sweet potatoes; cut into wedges", "\nSalt and pepper", "\n¼ cup olive oil", "\n6 hamburger buns; cut horizontally and buttered", "\n                ", "2 tbsp. olive oil", "\n1 large pineapple; skin removed and sliced into 5–8 mm thick rounds", "\n6 chicken breasts", "\n                ", "1 bottle of smoky BBQ sauce", "\n2 large tomatoes", "\nA small head of lettuce; washed", "\nMayonnaise; to serve", "\n"], "methods": ["Preheat the oven to 220 °C. Place sweet potato wedges on a roasting tray, then season with salt and pepper and drizzle with oil.", "\n", "Roast for 25 min. until golden brown and tender.", "\n", "Toast the buttered buns in a dry pan until golden brown, then set aside.", "\n", "Using the same pan, add some olive oil and fry the pineapple slices over high heat until caramelised on both sides. Set aside.", "\n", "Place the chicken breasts on a layer of cling film, then cover with another layer.", "\n", "Use a rolling pin to beat the breasts until they are about 1 cm thick.", "\n", "Fry the breasts in a little oil in the same pan on both sides, basting with some BBQ sauce during the last 2 min.", "\n", "Remove from the heat.", "\n", "Assemble the burgers by placing some lettuce and tomato on the bottom halves of each bun.", "\n", "Then top with mayonnaise, a chicken breast, grilled pineapple and the top half of the bun.", "\n", "Pakco’s smoky BBQ sauce is very affordable, but you can choose any other BBQ sauce that you love.", "\n", "Substitute the sweet potatoes with regular potatoes, if preferred."]},
{"recipe_name": "\n                Chilli Beef Wraps\n            ", "description": "\n                    Lovers of the basics will enjoy the combination of tomato, onion and green peppers as well as how simple it is to make. Serve at game time to hungry football lovers. Can be switched up with anything from bread to nachos.\n                ", "ingredients": ["\n                ", "2 onions, chopped", "\n2 carrots, chopped", "\n2 celery sticks, chopped", "\n1 tbsp. olive oil", "\n1 kg beef mince", "\n65 g Tomato Paste", "\n                ", "1 can (410 g) Tomato, Onion and Green Pepper", "\n1 can (410 g) Butter Beans in Brine", "\nSalt and coarsely ground black pepper", "\n                ", "1 can (410 g) Red Speckled Sugar Beans in Brine, drained", "\nSoft flour tortillas or wraps", "\nCoriander leaves"], "methods": ["Fry the onions, carrots and celery together in the oil until soft.", "\n", "Add the mince and fry for a further 5 minutes or until the mince has browned.", "\n", "Add the tomato paste. Simmer for 30 minutes.", "\n", "Add the butter beans with its brine and drained red speckled sugar beans. Season to taste and simmer for another 10 minutes.", "\n", "Heat the tortillas according to the instructions on the packet, fill with the mince mixture, add some coriander leaves to taste and serve."]},
{"recipe_name": "\n                Gourmet Hot Dogs\n            ", "description": "\n                    These cheesy hot dogs will please kids and grown-ups alike; just swap an accompanying beer for a juice box to pack the perfect gourmet school lunch.\n                ", "ingredients": ["\n                ", "4 sausages; scored", "\nmustard", "\n4 hot dog rolls", "\n125 g Cheese; sliced", "\n", "\n", "\n2 tbsp. (30 ml) olive oil", "\n3 onions; peeled and thinly sliced", "\n1 tbsp. (15 ml) chopped fresh rosemary", "\n", "\n                ", "2 tbsp. (30 ml) sugar", "\n3 tbsp. (45 ml) balsamic vinegar", "\nSalt and freshly ground pepper", "\n", "\n", "\n2 tbsp. (30 ml) olive oil", "\n1 onion; peeled and finely chopped", "\n                ", "6 tomatoes; roughly chopped", "\n1 garlic clove; peeled and crushed", "\n1 tbsp. (15 ml) sugar", "\nPinch of dried chilli", "\n2 tsp. (10 ml) white wine vinegar", "\nSalt and freshly ground pepper", "\n2 tbsp. (30 ml) olive oil"], "methods": ["To make the caramelised onions, heat olive oil in a frying pan and sauté onions and rosemary for about 15 min. over a low heat until softened and translucent.", "\n", "Increase heat and add sugar and balsamic vinegar and continue to fry until sticky and caramelised.", "\n", "To make the tomato relish, heat olive oil in a frying pan and sauté onion, tomatoes and garlic over medium heat for about 10 minutes or until softened.", "\n", "Add sugar, dried chilli, vinegar and salt and pepper to taste.", "\n", "Continue to cook for 5–7 min. or until mixture has thickened slightly. Set aside.", "\n", "Heat remaining oil in a frying pan and fry sausages until golden and Spread one side of each hot dog roll with mustard and add a sausage. Top with a few slices of cheese, a little tomato relish and some caramelised onions.", "\n"]},
{"recipe_name": "\n                Variety Of Braai Sarmies\n            ", "description": "\n                    How good is your barbecue sandwich game? We’ve got a variety of lip-smacking fillings to make match day even sweeter!\n                ", "ingredients": ["\n                ", "Variety of slices of bread such as rye,", "\nciabatta, white or sourdough", "\n(2 slices per sandwich)", "\nButter", "\n                ", "Slices of cheese", "\nSlices of red onion, smooth", "\nApricot jam", "\nTomato pesto", "\nFresh basil", "\nCrumbled feta cheese", "\nTomato jam", "\nRoughly chopped fresh chives", "\nCrumbled blue cheese", "\n                ", "Olive tapenade", "\nSliced or grated Cheddar cheese", "\nFresh origanum", "\nCoriander pesto", "\nSlices of red pepper", "\nSlices of tomato", "\nSlices of black pepper cream cheese", "\nSlices of red onion", "\nFresh rocket"], "methods": ["Butter two slices of bread of your choice.", "\n", "Arrange any of the filling suggestions on one slice, place a second slice on top and secure with string.", "\n", "Braai over moderate coals until bread is crisp and brown and cheese has melted. Turn frequently."]},
{"recipe_name": "\n                Mini Boerewors Burgers\n            ", "description": "\n                    Next time you need a game time meal, try this scrumptious boerewors burger recipe. Pair our delicious boerewors with a soft, fluffy roll and a herby pesto mayo for a flavour explosion.\n                ", "ingredients": ["\n                ", "4 mini hamburger rolls", "\n400-500 g thin sausage, rolled into 4 small spirals and with a cocktail stick", "\n15 ml (1 tbsp.) basil pesto mixed with 80 ml (1/3 cup) mayonnaise", "\n                ", "4 cos lettuce leaves", "\n8 slices mozzarella cheese", "\n1 red onion, sliced into rings", "\n", "\n                ", "1 can (400 g) tomato and onion mix, mixed with one chopped fresh tomato and sundried tomato pesto"], "methods": ["Preheat the oven to 180 °C or prepare barbecue coals.", "\n", "Halve the rolls horizontally and toast lightly.", "\n", "Cook the sausage in the oven, on a griddle pan or over the coals.", "\n", "Spread the bottom half of each roll with pesto mayonnaise.", "\n", "Follow with a lettuce leaf and two slices of cheese, then a sausage spiral and some onion rings.", "\n", "Top with a spoonful of tomato and onion mix and cover with the other half of the roll. Keep in place with a cocktail stick."]},
{"recipe_name": "\n                Berry Ice Cream Lollies\n            ", "description": "\n                    The perfect snack for a hot day, these berry ice cream lollies are sweet and refreshing home made treats the whole family can enjoy. Makes 8 lollies.\n                ", "ingredients": ["\n                ", "500g strawberries", "\n200g sugar", "\n                ", "250ml water", "\n                ", "8 sucker sticks"], "methods": ["Blend out the strawberries.", "\n", "Stir the sugar in water over a mild heat until it’s dissolved. Bring to the boil and simmer for 5 minutes. Let it cool.", "\n", "Mix the strawberry puree with 180ml of the cooled syrup. Pour into ice lolly moulds, place sticks and freeze."]},
{"recipe_name": "\n                Dark Chocolate Brownies\n            ", "description": "\n                    Classic brownies get a healthy twist with our decadent dark chocolate brownies. These sweet treats are perfect as a dessert or an after lunch snack. Makes 8 – 10 brownies\n                ", "ingredients": ["\n                ", "1 cup unsalted butter", "\n1 cup bittersweet chocolate", "\n2 cups sugar", "\n                ", "2 teaspoons vanilla extract ", "\n5 large eggs ", "\n1/3 cup unsweetened cocoa powder", "\n", "\n                ", "2/3 cup all-purpose flour", "\n½ teaspoon salt"], "methods": ["Preheat the oven to 350 degrees. Grease and flour a baking pan.", "\n", "Melt the butter and chocolate over a low heat. Stir until smooth and remove from heat.", "\n", "Whisk in the sugar and vanilla once the chocolate mixture has cooled. Whisk in the eggs, one at a time until the mixture is smooth.", "\n", "Sift the cocoa powder, flour and salt in a separate bowl. Whisk in the chocolate mixture until smooth.", "\n", "Spread the brownie batter into the greased pan and bake for 25-35 minutes. Let them cool before cutting."]},
{"recipe_name": "\n                Oreo Chocolate Chip Cookies\n            ", "description": "\n                    Get creative in the kitchen with these Oreo chocolate chip cookies. This fun cookie within a cookie is great on its own and can be dunked in classic Oreo style. Makes 16 cookies.\n                ", "ingredients": ["\n                ", "1 pack of Oreos", "\n440g softened butter", "\n170g light brown sugar", "\n                ", "220g granulated sugar", "\n2 large eggs", "\n1 tablespoon vanilla extract", "\n                ", "800g plain flour", "\n1 tablespoon baking soda", "\n280g chocolate chips"], "methods": ["Preheat the oven to 350 degrees.", "\n", "Cream the butter and sugars together in a stand or electric mixer. Add in the eggs and vanilla. Mix well.", "\n", "Mix all the dry ingredients in a separate bowl and slowly add to the wet ingredients along with the chocolate chips. Don’t overmix.", "\n", "Cover the top and bottom of the Oreo cookie each with a scoop of cookie dough. Cup the cookie with your hands to seal the edges.", "\n", "Place on a baking sheet and bake for 9-13 minutes. Let them cool for 5 minutes and transfer to cooling rack.", "\n"]},
{"recipe_name": "\n                Coronation Chicken Salad\n            ", "description": "\n                    This recipe draws inspiration from the traditional coronation chicken salad for maximum flavour, while giving it some modern convenience. Tangy and tasty, it combines all the right ingredients in just the right amounts and is absolutely divine served on some crusty bread. Sandwich it between two slices of ciabatta for a real gourmet sandwich that’s perfect for lunch or a light dinner. Serves 2 - 4\n                ", "ingredients": ["\n                ", "Salt and pepper to taste", "\n300 g chicken breast fillet, cut into strips", "\n30 - 45 ml (2 - 3 tbsp.) olive oil", "\n1 onion, finely chopped", "\n30 ml (2 tbsp.) butter", "\n                ", "30 ml (2 tbsp.) mild curry powder", "\n115 g Rhodes Tomato Paste", "\n2 bay leaves", "\n250 ml (1 cup) red wine", "\n                ", "80 ml (⅓ cup) Rhodes Smooth Apricot Jam", "\n250 ml (1 cup) chicken stock", "\n250 ml (1 cup) mayonnaise", "\n125 ml (½ cup) plain yoghurt"], "methods": ["Season the chicken and fry in the olive oil until lightly cooked. Set aside.", "Fry the onion in the butter until soft, add the curry powder, Rhodes Tomato Paste and bay leaves. Cook for 2 minutes. Add the wine and simmer until it reduces and the mixture is almost dry.", "Add the Rhodes Smooth Apricot Jam and the chicken stock and allow to reduce over low heat to a thick syrupy consistency. Set aside to cool.", "In a large mixing bowl, combine 190 ml (¾ cup) of the reduced mixture with the mayonnaise and yoghurt. Season to taste and stir in the cooked chicken.", "Refrigerate for 1 hour before serving.", "\n"]},
{"recipe_name": "\n                Tuna Melt\n            ", "description": "\n                    It’s hard enough to turn down anything seasoned with melted cheese, let alone the creamy goodness of this tuna mayonnaise toasted sandwich. This gourmet ciabatta is perfect if you’re looking for decadent lunch ideas, with the spinach adding some extra nutrients. If you’re tired of the old toasty, try this baked sarmie – it turns an everyday favourite into a special treat.\n                ", "ingredients": ["\n                ", "2 cans (187 g each) tuna chunks in water, drained", "\n125 ml (½ cup) mayonnaise", "\n                ", "60 ml (¼ cup) Greek yoghurt", "\n250 ml (1 cup) grated mozzarella cheese", "\n                ", "Salt and pepper", "\n4 ciabattas", "\n500 ml (2 cups) baby spinach"], "methods": ["Preheat the oven to 200°C.", "Mix the tuna, mayonnaise, yoghurt, cheese, salt and pepper.", "Cut each ciabatta open and arrange the spinach on the bottom half, followed by the tuna mixture. Close the rolls and toast in the oven for 10 minutes or until the cheese in the mixture has melted. Serve immediately."]},
{"recipe_name": "\n                Egg And Ham Cups\n            ", "description": "\n                    A bite-sized breakfast, from the heart.\n                ", "ingredients": ["\n                ", "1 croissant", "\n2 large eggs", " ", "\n                ", "2 slices ham", "\n2-3 tbsp chutney", "\n", "\n                ", "1 tbsp butter or margarine", "\nsalt and pepper", "\n"], "methods": ["Preheat the oven to 180ºC.", "\n", "Cut the croissant in half and then into 2 heart shapes, using a heart-shaped cookie stencil.", "\n", "Spread some chutney onto each slice of croissant.", "\n", "Slice the ham slices in half to make heart-shaped slices, using the heart-shaped cookie stencil again.", "\n", "Crack and fry your eggs in a frying pan.", "\n", "Place the fried eggs on top of your heart-shaped ham and croissants, cutting around them so they’re also heart-shaped.", "\n", "Season with a bit of salt and pepper."]},
{"recipe_name": "\n                Chocolate Swirl Banana Bread\n            ", "description": "\n                    A traditional favourite, with a twist.\n                ", "ingredients": ["\n                ", "4 mashed bananas", "\n½ cup of soft butter or margarine", "\n2 eggs", "\n                ", "1 tsp vanilla essence", "\n1 cup of sugar", "\n1 tsp baking powder", "\n                ", "½ teaspoon of salt", "\n1 ½ cups of white all-purpose flour", "\n2 tbsp chocolate syrup"], "methods": ["Preheat the oven to 180ºC.", "\n", "Mix together all your dry ingredients.", "\n", "Next, mix together all your wet ingredients, except for the chocolate syrup.", "\n", "Blend all your ingredients together in a mixing bowl.", "\n", "Grease a bread pan and pour 1/3 of the mixture into the pan. Drizzle 1 tablespoon of the chocolate syrup on top of the mixture. ", "\n", "Repeat this until all the mixture and syrup is poured into the pan.", "\n", "Bake the bread for 50 minutes to 1 hour until it’s golden brown.", "\n", "Serve with butter or jam."]},
{"recipe_name": "\n                Cauliflower and Broccoli Soup\n            ", "description": "\n                    This easy-to-follow cauliflower and broccoli soup recipe has everything you need in a winter’s meal. Wholesome, hearty and creamy, it will be a hit on any chilly evening. If you want to add an extra dash of flavour, try sprinkling some crispy fried bacon pieces over the soup before serving it. Serves 6 – 8.\n                ", "ingredients": ["\n                ", "2 heads broccoli", "\n2 heads cauliflower", "\n2 glasses water", "\n", "\n                ", "½ cup of cream", "\n500 g ham", "\nSalt", "\n                ", "Pepper", "\nFresh mixed herbs"], "methods": ["Put broccoli and cauliflower in a pot with water and add salt, pepper and mixed herbs.", "\n", "Cook until the broccoli and cauliflower is al dente (tender but firm).", "\n", "Blend the above mixture in a blender, then put back into the pot and add more herbs to your taste.", "\n", "Add the ham and fresh cream.", "\n", "Mix well.", "\n", "Keep it on the heat for another 20 minutes so that the flavours can fuse.", "\n", "Add bacon as a topping before serving.", "\n"]},
{"recipe_name": "\n                Mex Tex Nachos\n            ", "description": "\n                    Originating in Mexico, it comes as no surprise that nachos are famed for taste, and the addition of mince to this specific recipe gives it that final, filling finish and flavour. This recipe is not only cost-effective, but makes for a versatile dish, which means that you can have it as a snack, a relaxed meal for two, or even as a fun treat for your family. Why not host a Mexican food evening and add these to the menu? Serves: 6–8 as a starter 4 as a main meal\n                ", "ingredients": ["\n                ", "1 onion", "\n1 clove garlic", "\n1 tbsp. olive oil", "\n500 g beef mince", "\n1 can (410 g) of Tomatoes, Onions and Green Peppers", "\n                ", "Salt and ground black pepper", "\n1 large packet corn chips", "\n250 ml Cheddar cheese, grated", "\n1 (50 g) sachet Tomato Paste", "\n                ", "250 ml guacamole", "\n1 tsp. brown sugar", "\n125 ml sour cream", "\nCoriander leaves, chopped"], "methods": ["Finely chop the onion and garlic. Fry in the oil until soft.", "\n", "Add the mince and fry until browned.", "\n", "Add the Tomatoes, Onions and Green Peppers, the tomato paste and sugar. Simmer for 30 minutes.", "\n", "Season to taste.", "\n", "Arrange the corn chips on an oven-safe platter, top with the mince and sprinkle with the cheese.", "\n", "Bake in the oven (preheated to 180ºC) for 5 minutes or until the cheese has melted.", "\n", "Serve with guacamole, sour cream and coriander."]},
{"recipe_name": "\n                No Bake Unicorn Fudge\n            ", "description": "\n                    Whether you need kids party food ideas or just something to keep your family busy (while making a delicious kids snack), No Bake Unicorn Fudge is always a great idea! With a few simple ingredients (and no non kid-friendly equipment, like an oven) you’ll have a fun kid friendly recipe in no time.\n                ", "ingredients": ["\n                ", "100g softened butter or margarine", "\n10 tbsp. condensed milk", "\n                ", "1tsp. vanilla extract", "\n800g icing sugar", "\n                ", "Food colouring of your choice", "\nSprinkles of your choice"], "methods": ["Cream your butter or margarine, condensed milk and vanilla extract together. Turn your mixer down to low, then add the icing sugar and mix gently until combined. When the mixture looks like breadcrumbs, use your hands to form it into a ball.", "\n", "Split the mix into equally-sized balls (based on how many colours you want to make). Add a few drops of food colouring to each ball, then squeeze and knead to distribute the colour evenly. If the mixture feels too wet, add a little more icing sugar while kneading.", "\n", "Grab little balls of each colour of fudge, then place them into the tray in your desired pattern. Once all your fudge is in the tray, press down hard on it with your hands to ensure it is combined in the tray.", "\n", "Decorate with your desired sprinkles, press them lightly into the fudge, then cover and place into the fridge overnight (or into the freezer for an hour). Cut to your desired size and enjoy!"]}
]